        IDENTIFICATION DIVISION.
        PROGRAM-ID. requestStocks.
        
        environment division.
           input-output section.
               file-control.
                  

        DATA DIVISION.
           file section.
              

            WORKING-STORAGE SECTION.
        
        PROCEDURE DIVISION.
        
       STOP RUN.
 